---
type: HasNoValueFilterRule
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# HasNoValueFilterRule

`Autodesk.Revit.DB.HasNoValueFilterRule` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | HasNoValueFilterRule | 2020 | `public HasNoValueFilterRule ( ElementId parameter )` |